In [2]:
import pandas as pd
df = pd.DataFrame({'Col1': [10, 20, 15, 30, 45],
                    'Col2': [13, 23, 18, 33, 48],
                    'Col3': [17, 27, 22, 37, 52]})

In [3]:
df

   Col1  Col2  Col3
0    10    13    17
1    20    23    27
2    15    18    22
3    30    33    37
4    45    48    52

In [4]:
df.shift(periods=3)

   Col1  Col2  Col3
0   NaN   NaN   NaN
1   NaN   NaN   NaN
2   NaN   NaN   NaN
3  10.0  13.0  17.0
4  20.0  23.0  27.0

In [8]:
df.shift(-1)

   Col1  Col2  Col3
0  20.0  23.0  27.0
1  15.0  18.0  22.0
2  30.0  33.0  37.0
3  45.0  48.0  52.0
4   NaN   NaN   NaN

In [6]:
for i in range(0,1):
    print(df.shift(0))

   Col1  Col2  Col3
0    10    13    17
1    20    23    27
2    15    18    22
3    30    33    37
4    45    48    52